### Pandas: 
Its a powerful data manipulation library widely used for data analysis and data cleaning. it provides two primary data structures Series and DataFrame. A series is a one dimenssional array while DataFrame is a two dimensional. size mutable and potentially heterogeneous tablular data structure with labelled axes.

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\administrator\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\administrator\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\administrator\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\administrator\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\administrator\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\administrator\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd
print(pd.__version__)

2.2.2

###  Pandas Series:

A Series in pandas is a one-dimensional labeled array that can hold any data type (integers, floats, strings, etc.). It is like a column in a spreadsheet or a list with an index.

In [3]:
data = [1,2,3,4,5,6,7]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

#### create series from dictionary:

In [4]:
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data = [10,20,30]
index = ['a','b','c']

pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [6]:
marks = [98,97,94,92,98,96]
subjects = ['Marathi','English','Physics','Chemistry','Mathematics','Biology']

pd.Series(marks,index=subjects)

Marathi        98
English        97
Physics        94
Chemistry      92
Mathematics    98
Biology        96
dtype: int64

### DataFrame: 
A DataFrame is a two-dimensional, size-mutable, and labeled data structure in pandas, similar to a table or spreadsheet with rows and columns.

#### create a Dataframe from dictionary:

In [7]:
data = {
    'Name' : ['Ganesh','Dilip','Amol'],
    'Age' : [33,31,23],
    'City' : ['Bangalore','Nashik','Pune']
}

In [8]:
df = pd.DataFrame(data)
print(type(df))
print('--------------------------')
print(df)

<class 'pandas.core.frame.DataFrame'>
--------------------------
     Name  Age       City
0  Ganesh   33  Bangalore
1   Dilip   31     Nashik
2    Amol   23       Pune

#### create data frame from list of dictionaries:

In [9]:
data = [
    {'Name':'Ganesh','Age':33,'City':'Bangalore'},
    {'Name':'Ganaa','Age':34,'City':'Pune'},
    {'Name':'Dilip','Age':31,'City':'Nashik'},
    {'Name':'Amol','Age':23,'City':'Niphad'},
    {'Name':'Yogesh','Age':33,'City':'Dindori'},
]

In [10]:
df = pd.DataFrame(data)
print(type(df))
print('-------------------------------')
print(df)

<class 'pandas.core.frame.DataFrame'>
-------------------------------
     Name  Age       City
0  Ganesh   33  Bangalore
1   Ganaa   34       Pune
2   Dilip   31     Nashik
3    Amol   23     Niphad
4  Yogesh   33    Dindori

In [11]:
df1 = pd.read_csv('Sales Details.csv')
df1.head()    #top 10 records

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card

#### Accessing data from Data frame:

In [12]:
df1

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card
...,...,...,...,...,...,...,...
1495,B-25700,7,-3,2,Clothing,Hankerchief,COD
1496,B-25757,3151,-35,7,Clothing,Trousers,EMI
1497,B-25973,4141,1698,13,Electronics,Printers,COD
1498,B-25698,7,-2,1,Clothing,Hankerchief,COD
1499,B-25993,4363,305,5,Furniture,Tables,EMI

In [13]:
df

     Name  Age       City
0  Ganesh   33  Bangalore
1   Ganaa   34       Pune
2   Dilip   31     Nashik
3    Amol   23     Niphad
4  Yogesh   33    Dindori

In [14]:
df['Name']

0    Ganesh
1     Ganaa
2     Dilip
3      Amol
4    Yogesh
Name: Name, dtype: object

In [15]:
df[['Name','City']]

     Name       City
0  Ganesh  Bangalore
1   Ganaa       Pune
2   Dilip     Nashik
3    Amol     Niphad
4  Yogesh    Dindori

In [16]:
df.loc[0]

Name       Ganesh
Age            33
City    Bangalore
Name: 0, dtype: object

In [17]:
df.loc[0][0]    #showing name at the place of [0][0].

C:\Users\Administrator\AppData\Local\Temp\ipykernel_1492\1785976580.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]    #showing name at the place of [0][0].

'Ganesh'

In [18]:
df.iloc[0]

Name       Ganesh
Age            33
City    Bangalore
Name: 0, dtype: object

**1. .loc():** Uses labels (row/col names)  
**2. .iloc():** Uses integer positions

#### Accessing specific element:

In [19]:
df

     Name  Age       City
0  Ganesh   33  Bangalore
1   Ganaa   34       Pune
2   Dilip   31     Nashik
3    Amol   23     Niphad
4  Yogesh   33    Dindori

In [20]:
df.at[1,'Age']

34

In [21]:
df.iat[2,1]

31

In [22]:
df.iat[2,2]    #second row and second column.

'Nashik'

#### Data Manipulation with DataFrame:

In [23]:
df

     Name  Age       City
0  Ganesh   33  Bangalore
1   Ganaa   34       Pune
2   Dilip   31     Nashik
3    Amol   23     Niphad
4  Yogesh   33    Dindori

#### Adding a column:

In [24]:
df['Salary'] = [10000,20000,30000,40000,50000]

In [25]:
df

     Name  Age       City  Salary
0  Ganesh   33  Bangalore   10000
1   Ganaa   34       Pune   20000
2   Dilip   31     Nashik   30000
3    Amol   23     Niphad   40000
4  Yogesh   33    Dindori   50000

#### Remove a column:

In [26]:
df.drop('Salary',axis=1,inplace=True)    #inplace does the permanent changes.

In [27]:
df

     Name  Age       City
0  Ganesh   33  Bangalore
1   Ganaa   34       Pune
2   Dilip   31     Nashik
3    Amol   23     Niphad
4  Yogesh   33    Dindori

In [30]:
df['Age'] = df['Age']+1     # Age is increased by 1

In [31]:
df

     Name  Age       City
0  Ganesh   35  Bangalore
1   Ganaa   36       Pune
2   Dilip   33     Nashik
3    Amol   25     Niphad
4  Yogesh   35    Dindori

#### drop data row-wise

In [32]:
df.drop(0,inplace=True)

In [34]:
df     #data at 0th location is removed.

     Name  Age     City
1   Ganaa   36     Pune
2   Dilip   33   Nashik
3    Amol   25   Niphad
4  Yogesh   35  Dindori

In [35]:
df1 = pd.read_csv('Sales Details.csv')
df1.head()    #top 10 records

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card

#### Display data type of each column:

In [37]:
print(f'Data Types: {df1.dtypes}')

Data Types: Order ID        object
Amount           int64
Profit           int64
Quantity         int64
Category        object
Sub-Category    object
PaymentMode     object
dtype: object

#### Describe the Dataframe:

In [45]:
print(f'---- Statistical Summery:----')
df1.describe()

---- Statistical Summery:----

            Amount      Profit     Quantity
count  1500.000000  1500.00000  1500.000000
mean    291.847333    24.64200     3.743333
std     461.924620   168.55881     2.184942
min       4.000000 -1981.00000     1.000000
25%      47.750000   -12.00000     2.000000
50%     122.000000     8.00000     3.000000
75%     326.250000    38.00000     5.000000
max    5729.000000  1864.00000    14.000000